import { Typography, Stack, Box } from "@mui/material";
import Span from "../privacy-policy/components/Span";
import SpanLink from "../privacy-policy/components/SpanLink";
import Text from "../privacy-policy/components/Text";
import SectionHeader from "../privacy-policy/components/SectionHeader";
import UlText from "../privacy-policy/components/UlText";

export default function CookiesPolicy() {
  return (
    <Stack spacing={{ xs: 2, md: 3, lg: 4 }} mt={{ xs: 8, md: 0 }}>
      <Stack pb={{ xs: 4, md: 0 }} spacing={{ md: 2, lg: 0 }}>
        <Typography
          fontFamily="e-UkraineHead"
          fontSize={{ xs: "2rem", md: "2.5rem", lg: "3.125rem" }}
          fontWeight={700}
        >
          ПОЛІТИКА ВИКОРИСТАННЯ ФАЙЛІВ COOKIE
        </Typography>
        <Box
          width="100%"
          height="5px"
          borderRadius="5px"
          sx={{ backgroundColor: "primary.main" }}
        />
      </Stack>
      <Text>
        <Box component="img" src="/DOSIJEM.svg" height="1.25rem" width="auto" />{" "}
        (надалі іменується як «
        <Span>DOSIJEM</Span>
        » або «
        <Span> Компанія</Span>
        », а також «
        <Span>ми</Span>
        » або «
        <Span>нас</Span>
        »), діючи як контролер обробки персональних даних, розробили цю Політику
        використання файлів cookie (далі іменується також «
        <Span>Політика</Span>
        »), щоб надати вам інформацію відповідно до вимог 
        <SpanLink
          newTab
          url="https://eur-lex.europa.eu/legal-content/EN/ALL/?uri=celex%3A32016R0679&%3Btid=%5Badsimpletextid%5d"
        >
          Загального регламенту захисту даних (ЄС) 2016/679
        </SpanLink>
        , а також для надання чіткої, детальної та легкої для читання інформації
        про практику конфіденційності Компанії та пояснення того, яку інформацію
        ми збираємо, як ми збираємо, зберігаємо, передаємо та використовуємо
        інформацію, а також які права та можливості ви маєте в зв’язку з цим.
      </Text>
      <Text>
        <Span>Звертаємо вашу увагу: </Span>цю Політику слід читати разом із
        нашою{" "}
        <SpanLink url="/privacy-policy">Політикою конфіденційності</SpanLink>,
        яка містить повну інформацію про те, як і чому ми використовуємо вашу
        особисту інформацію, коли ви використовуєте цей вебсайт, а також надає
        детальну інформацію про ваші законні права щодо вашої особистої
        інформації та способи зв’язку з нами, якщо у вас є скарга.
      </Text>
      <SectionHeader>
        ВИЗНАЧЕННЯ ОСНОВНИХ ТЕРМІНІВ, ЯКІ МИ ВИКОРИСТАЛИ В ЦЬОМУ ДОКУМЕНТІ
      </SectionHeader>
      <Text>
        DOSIJEM використовує звичайні інструменти збору інформації, такі як
        файли cookie, вебмаяки та інші подібні технології відстеження.
      </Text>
      <Text>
        <Span>Файли cookie</Span> — це текстові файли, що містять невеликі
        обсяги інформації, які завантажуються на ваш пристрій (наприклад,
        комп’ютер, смартфон, електронний пристрій, який має доступ до
        Інтернету), коли ви відвідуєте вебсайт. Файли cookie дозволяють вебсайту
        розпізнавати пристрій користувача і вподобання та загалом допомагають
        покращити роботу в Інтернеті. Ви можете знайти більше інформації про
        файли cookie на: 
        <SpanLink newTab url="https://www.allaboutcookies.org">
          www.allaboutcookies.org
        </SpanLink>{" "}
        та{" "}
        <SpanLink newTab url="https://www.youronlinechoices.com">
          www.youronlinechoices.com
        </SpanLink>
        .
      </Text>
      <Text>
        <Span>Вебмаяки</Span> (іноді їх називають прозорими GIF-файлами, чіткими
        GIF-файлами або веббагами) — це невеликі рядки коду, які дають нам змогу
        доставляти невелике графічне зображення (зазвичай невидиме) на
        вебсторінці чи в електронному листі. Вебмаяки можуть розпізнавати певні
        типи інформації на вашому комп’ютері, наприклад файли cookie, час і дату
        перегляду сторінки та опис сторінки, на якій розміщено вебмаяк.
      </Text>
      <Text>
        Інші технології, зокрема вебсховище та ідентифікатори, пов’язані з вашим
        пристроєм, можуть використовуватися для подібних цілей. 
      </Text>
      <Text>
        <Span>
          У цій Політиці ми використовуємо словосполучення «файли cookie», щоб
          обговорити всі ці технології.
        </Span>
      </Text>
      <SectionHeader>ЦІЛІ ЗБОРУ ТА ВИКОРИСТАННЯ ФАЙЛІВ COOKIE</SectionHeader>
      <Text>
        DOSIJEM використовує файли cookie та аналогічні технології, щоб
        автоматично збирати інформацію під час навігації нашим вебсайтом,
        персоналізувати вміст і рекламу, надавати функції соціальних мереж й
        аналізувати наш трафік. 
      </Text>
      <Text>
        Ми також надаємо інформацію про ваше використання нашого вебсайту нашим
        партнерам із соціальних мереж, реклами та аналітики, які можуть
        поєднувати її з іншою інформацією, яку ви їм надали або яку вони зібрали
        під час використання вами їхніх послуг.
      </Text>
      <Text>
        <Span>
          Самі по собі файли cookie не ідентифікують вас конкретно. Натомість,
          вони розпізнають ваш браузер. Отже, якщо ви не ідентифікуєте себе
          конкретно для DOSIJEM, як-от подавши заявку, ми не дізнаємось хто ви,
          лише тому, що ви відвідали наш вебсайт.
        </Span>
      </Text>
      <Text>
        <Span>
          Інформація про відвідувачів, отримана вебсайтом за допомогою файлів
          cookie або інших аналогічних технологій, не продається і не
          поширюється у відкритому доступі.
        </Span>
      </Text>
      <SectionHeader>КАТЕГОРІЇ ТА ТИПИ ФІЙЛІВ COOKIE</SectionHeader>
      <Text>
        <Span>Файли cookie поділяються на такі категорії:</Span>
      </Text>
      <Text>
        <Span>постійні</Span> – зберігаються на пристрої, доки ви їх не видалите
        (їх називають <Span> «постійними» файлами cookie</Span>),
      </Text>
      <Text>
        <Span>тимчасові</Span> – зберігаються лише доти, доки ви не закриєте
        браузер (їх називають<Span>«сеансовими» файлами cookie</Span>).
      </Text>
      <Text>
        Ми використовуємо і <Span>«постійні»</Span>, і{" "}
        <Span>«сеансові» файли cookie</Span>.
      </Text>
      <Text>Крім того, існують різні види файлів cookie.</Text>
      <Text>
        <Span>
          DOSIJEM використовує такі типи файлів cookie: основні або необхідні
          файли cookie, функціональні файли cookie, аналітичні файли cookie,
          рекламні або цільові файли cookie.
        </Span>{" "}
        Додаткову інформацію про ці типи читайте нижче.
      </Text>
      <Text>
        <Span>Основні або необхідні файли cookie</Span>
      </Text>
      <Text>
        Ці файли cookie необхідні для функціонування вебсайту, і їх не можна
        вимкнути в наших системах. Зазвичай вони встановлюються лише у відповідь
        на виконані вами дії, які є запитом на надання послуг, наприклад,
        встановлення ваших налаштувань конфіденційності, вхід та навігація по
        вебсайту, використання функцій вебсайту або заповнення форм. Ви можете
        налаштувати свій браузер на блокування цих файлів cookie або сповіщення
        про них, але деякі частини вебсайту не працюватимуть. Ці файли cookie не
        зберігають жодної особистої інформації.
      </Text>
      <Text>Нам не потрібна ваша згода на використання цих файлів cookie.</Text>
      <Text>
        <Span>Функціональні файли cookie</Span>
      </Text>
      <Text>
        Ці файли cookie дозволяють вебсайту надавати розширену функціональність
        і персоналізацію. Вони можуть бути встановлені нами або сторонніми
        постачальниками, чиї послуги ми додали на наші сторінки. 
      </Text>
      <Text>
        Ми встановлюємо ці типи файлів cookie лише тоді, коли ви дали нам свою
        згоду на це. Якщо ви не дозволите ці файли cookie, деякі або всі
        перелічені вище сервіси можуть не працювати належним чином.
      </Text>
      <Text>
        <Span>Аналітичні файли cookie</Span>
      </Text>
      <Text>
        Ці файли cookie дозволяють нам підраховувати відвідування та джерела
        трафіку, щоб ми могли вимірювати та покращувати продуктивність нашого
        вебсайту. Вони допомагають нам дізнатися, які сторінки є найбільш і
        найменш популярними, і бачити, як відвідувачі переміщуються вебсайтом.
        Уся інформація, яку збирають ці файли cookie, є агрегованою і, отже,
        анонімною. Вони можуть бути встановлені нами або сторонніми
        постачальниками, чиї послуги ми додали на наші сторінки. 
      </Text>
      <Text>
        Ми встановлюємо ці типи файлів cookie лише тоді, коли ви дали нам свою
        згоду на це. Якщо ви не дозволите ці файли cookie, ми не зможемо
        відстежувати ефективність нашого вебсайту та покращувати його,
        пристосовуючи до наших відвідувачів.
      </Text>
      <Text>
        <Span>Рекламні або таргетингові файли cookie</Span>
      </Text>
      <Text>
        Ці файли cookie можуть бути встановлені на нашому вебсайті нашими
        рекламними партнерами. Ці компанії можуть використовувати їх для
        створення профілю ваших інтересів і показу відповідної реклами на інших
        вебсайтах. Вони не зберігають безпосередньо особисту інформацію, а
        базуються на унікальній ідентифікації вашого браузера та
        інтернет-пристрою. 
      </Text>
      <Text>
        Ми встановлюємо ці типи файлів cookie лише тоді, коли ви дали нам свою
        згоду на це. Якщо ви не дозволите ці файли cookie, ви побачите менш
        цільову рекламу.
      </Text>
      <Text>
        Як ми зазначали вище, Компанія використовує як основні, так і сторонні
        файли cookie. Основні файли cookie встановлюються вебсайтом, який ви
        відвідуєте. Сторонні файли cookie встановлюються доменом, який
        відрізняється від вебсайту, який ви відвідуєте.
      </Text>
      <SectionHeader>ЗГОДА</SectionHeader>
      <Text>
        <Span>
          Закон визначає, що ми можемо зберігати файли cookie на вашому
          пристрої, якщо вони строго необхідні для роботи цього вебсайту
          (Основні файли cookie). 
        </Span>
      </Text>
      <Text>
        <Span>
          Для використання всіх інших типів файлів cookie (Функціональних,
          Аналітичних та Рекламних) нам потрібна ваша згода. 
        </Span>
      </Text>
      <Text>
        Ви надаєте згоду на встановлення цих типів файлів cookie, обравши
        «ДОЗВОЛИТИ ВСІ ФАЙЛИ COOKIE». 
      </Text>
      <Text>
        Якщо в будь-який момент ви захочете змінити налаштування файлів cookie,
        зокрема відкликати свою згоду на цю обробку, ми радимо вам зробити це як
        описано нижче. Можливо, вам доведеться оновити сторінку, перш ніж зміни
        налаштувань набудуть чинності.
      </Text>
      <SectionHeader>УПРАВЛІННЯ ФАЙЛАМИ COOKIE:</SectionHeader>
      <Text>
        <Span>Використовуючи Інструмент отримання згоди. </Span>Коли ви
        відвідуєте наш вебсайт уперше, з’явиться банер із згодою на використання
        файлів cookie, у якому вам буде запропоновано налаштувати параметри
        файлів cookie.
      </Text>
      <Text>
        Зверніть увагу, що основні файли cookie не можна вимкнути, і якщо ви
        вирішите відмовитися від функціональних файлів cookie, це може вплинути
        на певні функції нашого вебсайту.
      </Text>
      <Text>
        Якщо ви бажаєте видалити файли cookie у своєму браузері, зробіть це в
        налаштуваннях або розділах налаштувань вашого браузера. Наведені нижче
        кроки описують загальну процедуру для деяких із найпопулярніших
        браузерів.
      </Text>
      <Text>
        <Span>Використовуючи ваш браузер. </Span>Ви можете скористатися
        налаштуваннями свого браузера, щоб відмовитися від функціональних,
        аналітичних та рекламних файлів cookie.
      </Text>
      <Text>
        Основні браузери (перераховані нижче) налаштовані на автоматичний прийом
        файлів cookie. Для того щоб їх відключити, скористайтеся функцією
        довідки в своєму браузері. Щоб дізнатися більше про налаштування файлів
        cookie, зверніться до довідок вашого браузера: 
      </Text>
      <Text>
        <SpanLink
          newTab
          url="https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop"
        >
          Google Chrome Help
        </SpanLink>{" "}
        – для <Span>CHROME</Span>;
      </Text>
      <Text>
        <SpanLink
          newTab
          url="https://support.mozilla.org/uk/kb/rozshirenij-zahist-vid-stezhennya-u-firefox-dlya-k?redirectslug=enable-and-disable-cookies-website-preferences&redirectlocale=en-US"
        >
          Mozilla Firefox Help
        </SpanLink>{" "}
        – для <Span>MOZILLA FIREFOX</Span>;
      </Text>
      <Text>
        <SpanLink
          newTab
          url="https://support.microsoft.com/uk-ua/windows/%D0%BA%D0%B5%D1%80%D1%83%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F-%D1%84%D0%B0%D0%B9%D0%BB%D0%B0%D0%BC%D0%B8-cookie-%D0%B2-microsoft-edge-%D0%BF%D0%B5%D1%80%D0%B5%D0%B3%D0%BB%D1%8F%D0%B4-%D0%B4%D0%BE%D0%B7%D0%B2%D1%96%D0%BB-%D0%B1%D0%BB%D0%BE%D0%BA%D1%83%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F-%D0%B2%D0%B8%D0%B4%D0%B0%D0%BB%D0%B5%D0%BD%D0%BD%D1%8F-%D1%82%D0%B0-%D0%B2%D0%B8%D0%BA%D0%BE%D1%80%D0%B8%D1%81%D1%82%D0%B0%D0%BD%D0%BD%D1%8F-168dab11-0753-043d-7c16-ede5947fc64d"
        >
          Internet Explorer Help
        </SpanLink>{" "}
        – для <Span>INTERNET EXPLORER</Span>;
      </Text>
      <Text>
        <SpanLink
          newTab
          url="https://support.apple.com/uk-ua/guide/safari/sfri11471/mac"
        >
          Safari Help
        </SpanLink>{" "}
        – для <Span>SAFARI</Span>.
      </Text>
      <Text>
        <Span>Важливо:</Span> конфігурація налаштувань файлів cookie для
        браузерів мобільних пристроїв може відрізнятися.
      </Text>
      <Text>
        <Span>Використовуючи налаштування «Не відстежувати»</Span>. Деякі
        браузери дозволяють параметр «не відстежувати» (DNT), який вимагає від
        вебпрограми вимкнути відстеження окремого користувача. Якщо ви вирішите
        ввімкнути налаштування DNT у своєму браузері, ваш браузер надішле
        спеціальний сигнал вебсайтам, аналітичним компаніям, рекламним мережам,
        постачальникам плагінів та іншим вебсервісам, з якими ви стикаєтесь під
        час перегляду, і припинить відстеження вашої активності. Щоб налаштувати
        DNT, відвідайте сторінку{" "}
        <SpanLink
          newTab
          url="https://fpf.org/thank-you-for-visiting-allaboutdnt-com/"
        >
          All About DNT
        </SpanLink>
        . Якщо ви вирішите налаштувати DNT, ми автоматично вимкнемо для вас усі
        необов’язкові файли cookie на нашому вебсайті. Зверніть увагу, що це
        може вплинути на функціональність вебсайту.
      </Text>
      <Text>
        <Span>Використовуючи «Глобальний контроль конфіденційності»</Span>
        . «Глобальний контроль конфіденційності» (GPC) — це технічна
        специфікація, яку можна використовувати для інформування вебсайтів про
        ваші налаштування конфіденційності щодо засобів відстеження реклами. Щоб
        налаштувати GPC, ви можете відвідати сторінку{" "}
        <SpanLink newTab url="https://globalprivacycontrol.org/#about">
          Global Privacy Control
        </SpanLink>
        . Якщо ви вирішите налаштувати GPC, ми автоматично вимкнемо для вас усі
        непотрібні файли cookie на нашому вебсайті. Зверніть увагу, що це може
        вплинути на функціональність вебсайту.
      </Text>
      <Text>
        <Span>Відмова від рекламних файлів cookie</Span>. Щоб дізнатися більше
        про те, як відмовитися від таргетингових і рекламних файлів cookie, ви
        можете скористатись одним із інструментів:
      </Text>
      <UlText>
        <SpanLink
          newTab
          url="https://www.youronlinechoices.com/uk/your-ad-choices"
        >
          Your Online Choices
        </SpanLink>
        ;
      </UlText>
      <UlText>
        <SpanLink newTab url="https://thenai.org/how-to-opt-out/">
          Network Advertising Initiative
        </SpanLink>
        ;
      </UlText>
      <UlText>
        <SpanLink newTab url="https://optout.aboutads.info/?locale=en-US">
          Digital Advertising Alliance’s Consumer Choice
        </SpanLink>
        .
      </UlText>
      <Text>
        Ці інструменти відмови надаються третіми сторонами. Ми не контролюємо та
        не керуємо цими інструментами чи вибором, який рекламодавці та інші
        надають за допомогою цих інструментів.
      </Text>
      <Text>
        Також ви може відмовитися від відображення цільової реклами за допомогою
        налаштувань на пристрої. Щоб дізнатися більше про те, як це зробити,
        перейдіть за посиланням: 
      </Text>
      <Text>
        <SpanLink newTab url="https://support.apple.com/en-us/HT202074">
          https://support.apple.com/en-us/HT202074
        </SpanLink>{" "}
        - <Span>для користувачів пристроїв з iOS and macOS</Span>
      </Text>
      <Text>
        <SpanLink
          newTab
          url="https://support.google.com/android/answer/3467281?hl=en"
        >
          https://support.google.com/android/answer/3467281?hl=en
        </SpanLink>{" "}
        - <Span>для користувачів пристроїв з Android</Span>
      </Text>
      <Text>
        Ви також можете контролювати рекламу, яку бачите{" "}
        <Span>
          у сервісах Google, на вебсайтах і у застосунках партнерів Google
        </Span>
        . Щоб дізнатися більше, перейдіть за посиланням:{" "}
        <SpanLink
          newTab
          url="https://support.google.com/My-Ad-Center-Help/answer/12155451?hl=en&co=GENIE.Platform&visit_id=638041440404128276-2248717258&rd=1"
        >
          https://support.google.com/My-Ad-Center-Help/answer/12155451?hl=en&co=GENIE.Platform&visit_id=638041440404128276-2248717258&rd=1
        </SpanLink>
      </Text>
      <SectionHeader>ВЗАЄМОДІЯ ВЕБСАЙТУ З ІНШИМИ РЕСУРСАМИ</SectionHeader>
      <Text>
        На вебcайті можуть бути посилання на інші вебсайти (лише в інформаційних
        цілях). При переході за посиланням на інші вебсайти, дія цієї Політики
        на такі вебсайти поширюватися не буде. У зв’язку з чим Компанія
        рекомендує переглядати політику конфіденційності та використання файлів
        cookie кожного вебсайту перед тим, як передавати будь-які персональні
        дані, за якими вас можуть ідентифікувати.
      </Text>
      <SectionHeader>ДОПОМОГА ТА ОСКАРЖЕННЯ</SectionHeader>
      <Text>
        Якщо у вас виникли запитання щодо цієї Політики або інформації, яку ми
        збираємо про вас, зв’яжіться з нами по імейлу dosijemhelp@gmail.com
      </Text>
      <SectionHeader>ОНОВЛЕННЯ ПОЛІТИКИ</SectionHeader>
      <Text>
        DOSIJEM залишає за собою право час від часу оновлювати цю Політику,
        публікуючи переглянуту Політику на вебсайті та вказуючи в Політиці дату
        останнього оновлення.
      </Text>
      <Text>
        Ми рекомендуємо вам переглядати цю Політику, а також 
        <SpanLink url="/privacy-policy">Політику конфіденційності</SpanLink>
         щоразу, коли ви відвідуєте наш вебсайт, щоб визначити, чи були внесені
        будь-які зміни, і переконатися, що ви розумієте, як будуть оброблятися
        будь-які надані вами персональні дані.
      </Text>
      <Text>
        <Span>Ця Політика була востаннє змінена 18 жовтня 2023 року.</Span>
      </Text>
    </Stack>
  );
}
