import ReviewsAboutUsClient from "./ReviewsAboutUsClient";

type ReviewData = {
  username: string;
  rate: 5 | 4 | 3 | 2 | 1;
  reviewText: string;
};

async function getReviews(): Promise<ReviewData[]> {
  const res = await fetch("http://45.13.236.245:25591/api/reviews/random", {
    next: {
      revalidate: 30,
    },
  });

  if (!res.ok) {
    throw new Error("Failed to fetch reviews");
  }

  return res.json();
}

export default async function ReviewsAboutUs() {
  const reviewsData = await getReviews();
  const fallbackReviews: ReviewData[] = [
    {
      username: "Андреграунд",
      rate: 4,
      reviewText:
        "Якщо у кількох словах... турботливо, швидко, з великою віддачею (замовляв плагін)",
    },
    {
      username: "Papirus",
      rate: 5,
      reviewText:
        "Я не дуже гарний у підборі слів, тому не знаю, який саме відгук писати, але: Мені було дуже приємно з вами працювати. Щиро вдячний, що ви пішли назустріч моїй терміновості та оперативно допомагали з багами, які виникали в процесі. Наразі плагін стабільно працює, і ми і гравці задоволені - зараз це один із найпопулярніших івентів на сервері 💛",
    },
    {
      username: "Blaze",
      rate: 5,
      reviewText:
        "Я замовляв карту для відео на ютуб. Ви побудували її швидко та шикарно, буквально так, як ми собі уявляли. Усі правки були виконаны дуже швидко, а також велике спасибі за те, що ви щодня апдейтили прогрес - це мене дуже заспокоювало. білдери чади! 🧏",
    },
  ];
  const reviews = reviewsData.length !== 3 ? fallbackReviews : reviewsData;

  return <ReviewsAboutUsClient reviews={reviews} />;
}
