import { Typography, Stack, Box } from "@mui/material";
import Span from "../../components/Span";
import SpanLink from "../../components/SpanLink";
import Text from "../../components/Text";
import SectionHeader from "../../components/SectionHeader";
import UlText from "../../components/UlText";

export default function UkPage() {
  return (
    <Stack
      spacing={{ xs: 2, md: 3, lg: 4 }}
      mt={{ xs: 8, md: 0 }}
      sx={{ opacity: 0, animation: "FadeIn 1s ease forwards" }}
    >
      <Stack pb={{ xs: 4, md: 0 }} spacing={{ md: 2, lg: 0 }}>
        <Typography
          fontFamily="e-UkraineHead"
          fontSize={{ xs: "2rem", md: "2.5rem", lg: "3.125rem" }}
          fontWeight={700}
        >
          ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ
        </Typography>
        <Box
          width="100%"
          height="5px"
          borderRadius="5px"
          sx={{ backgroundColor: "primary.main" }}
        />
      </Stack>
      <Text>
        <Box component="img" src="DOSIJEM.svg" height="1.25rem" width="auto" />{" "}
        (надалі іменується як «
        <Span>DOSIJEM</Span>
        » або «
        <Span> Компанія</Span>
        », а також «
        <Span>ми</Span>
        » або «
        <Span>нас</Span>
        »), діючи як контролер обробки персональних даних, розробили цю Політику
        конфіденційності (далі іменується також «
        <Span>Політика</Span>
        »), щоб надати вам інформацію відповідно до вимог 
        <SpanLink
          newTab
          url="https://eur-lex.europa.eu/legal-content/EN/ALL/?uri=celex%3A32016R0679&%3Btid=%5Badsimpletextid%5d"
        >
          Загального регламенту захисту даних (ЄС) 2016/679
        </SpanLink>
        , а також для надання чіткої, детальної та легкої для читання інформації
        про практику конфіденційності Компанії та пояснення того, яку інформацію
        ми збираємо, як ми збираємо, зберігаємо, передаємо та використовуємо
        інформацію, а також які права та можливості ви маєте в зв’язку з цим.
      </Text>
      <Text>
        <Span>
          Перш за все ми хочемо засвідчити, що незалежно від вашого місця
          перебування, місця проживання, громадянства або місця з якого
          надходять ваші дані, ми пропонуємо однакові високі стандарти захисту
          конфіденційності для всіх наших відвідувачів, кандидатів у
          співробітники і співробітників, а також замовників і підрядників.
        </Span>
      </Text>
      <SectionHeader>
        ВИЗНАЧЕННЯ ОСНОВНИХ ТЕРМІНІВ, ЯКІ МИ ВИКОРИСТАЛИ В ЦЬОМУ ДОКУМЕНТІ
      </SectionHeader>
      <Text>
        «<Span>Персональні дані</Span>» або «<Span>особиста інформація</Span>
        » означає будь-яку інформацію, яка стосується фізичної особи (суб’єкта
        даних), яка ідентифікована або може бути ідентифікована.
      </Text>
      <Text>
        Суб’єктів даних можна ідентифікувати, якщо їх можна прямо чи
        опосередковано ідентифікувати, особливо за допомогою ідентифікатора,
        такого як ім’я, ідентифікаційний номер, дані про місцезнаходження,
        онлайн-ідентифікатор, або однією з кількох спеціальних характеристик,
        які виражають фізичну, фізіологічну, генетичну, ментальну, комерційну,
        культурну чи соціальну ідентичність цих фізичних осіб. На практиці сюди
        також входять усі дані, які будь-яким чином належать або можуть бути
        присвоєні особі. Наприклад, телефон, табельний номер особи, облікові
        дані, зовнішній вигляд, адреса – все це персональні дані.
      </Text>
      <Text>
        «<Span>Контролер</Span>» означає фізичну або юридичну особу, державний
        орган, агентство чи інший орган, який самостійно або спільно з іншими
        визначає цілі та засоби обробки персональних даних.
      </Text>
      <Text>
        «<Span>Обробка</Span>» означає будь-яку операцію або набір операцій, які
        виконуються з персональними даними або наборами персональних даних за
        допомогою автоматизованих засобів чи ні, наприклад збір, запис,
        організація, структурування, зберігання, адаптація або зміна, пошук,
        ознайомлення, використання, розголошення шляхом передачі, розповсюдження
        або іншим чином надання доступу, узгодження або поєднання, обмеження,
        стирання або знищення.
      </Text>
      <Text>
        «
        <SpanLink
          newTab
          url="https://eur-lex.europa.eu/legal-content/EN/ALL/?uri=celex%3A32016R0679&%3Btid=%5Badsimpletextid%5d"
        >
          Загальний регламент захисту даних (ЄС) 2016/679
        </SpanLink>
        » – Регламент (EE) 2016/679 Європейського парламенту та Ради від 27
        квітня 2016 року про захист фізичних осіб щодо обробки персональних
        даних та про вільне переміщення таких даних, та скасування Директиви
        95/46/EC (GDPR), який застосовується з 25 травня 2018 року.
      </Text>
      <SectionHeader>
        ТИПИ ПЕРСОНАЛЬНИХ ДАНИХ, ЯКІ МИ ОБРОБЛЯЄМО, СПОСОБИ, ЦІЛІ ТА ТРИВАЛІСТЬ
        ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
      </SectionHeader>
      <Text>
        Обсяг і тип персональних даних, які ми обробляємо, способи обробки
        даних, термін зберігання, а також цілі обробки залежать від рівня вашої
        взаємодії з нами.
      </Text>
      <Text>
        Зазвичай обробка персональних даних відбувається лише за згодою.
        Винятком є випадки, коли попередню згоду неможливо отримати з фактичних
        причин, а обробка даних дозволена законом.
      </Text>
      <Text>
        <Span>
          У будь-якому випадку будьте впевнені, що ми оброблятимемо будь-які
          типи особистої інформації з однаковою ретельністю та повагою.
        </Span>
      </Text>
      <Text>
        <Span>Якщо ви є відвідувачем нашого вебсайту</Span>
         (під яким ми маємо на увазі вебсайт), ми збираємо мінімальну кількість
        даних про вас (залежно від того, якою кількістю даних ви вибрали
        поділитися з нами) як описано нижче:
      </Text>
      <Text>
        Щоразу, коли ви переглядаєте наш вебсайт, наша система автоматично
        збирає дані та інформацію з системи пристрою, що використовується для
        встановлення зв’язку, а саме:
      </Text>
      <UlText>інформацію про тип і версію вашого інтернет-браузера;</UlText>
      <UlText>
        інформацію про операційну систему вашого пристрою (комп’ютера, смартфона
        тощо);
      </UlText>
      <UlText>інформацію про вашого інтернет-провайдера;</UlText>
      <UlText>вашу IP-адресу;</UlText>
      <UlText>дату та час вашого доступу;</UlText>
      <UlText>географічне положення;</UlText>
      <UlText>вебсайти, з яких ви зайшли до нас;</UlText>
      <UlText>вебсайти, які ви відвідуєте з нашого вебсайту;</UlText>
      <UlText>
        іншу інформацію про те, як ви взаємодіяли з нашим вебсайтом.
      </UlText>
      <Text>
        Ми обробляємо таку технічну інформацію в так званих «log-файлах». Такий
        збір даних та зберігання даних у log-файлах є необхідними для роботи
        вебсайту.
      </Text>
      <Text>
        Будь-яка технічна інформація, яку ми збираємо від вас, може бути
        використана для таких цілей:
      </Text>
      <UlText>для правильного відображення нашого вебсайту;</UlText>
      <UlText>
        для управління та захисту нашого вебсайту та нашого бізнесу, включаючи
        визначення причин будь-яких технічних проблем, для технічної оптимізації
        нашого вебсайту, покращення безпеки даних, усунення несправностей даних
        і систем, обслуговування та тестування системи, розміщення даних і
        звітування;
      </UlText>
      <UlText>
        для персоналізації вашого досвіду (інформація допоможе DOSIJEM краще
        відповідати вашим індивідуальним потребам щоб надати вам релевантний
        вміст вебсайту та виміряти або зрозуміти ефективність вмісту, який ми
        вам надаємо);
      </UlText>
      <UlText>
        для вдосконалення нашого вебсайту (DOSIJEM постійно прагне
        вдосконалювати пропозиції нашого вебсайту на основі інформації та
        відгуків, які ми отримуємо від вас);
      </UlText>
      <UlText>
        для виявлення, запобігання або розслідування інцидентів безпеки,
        шахрайства або зловживання та неправильного використання нашого вебсайту
        та послуг.
      </UlText>
      <Text>
        Дані будуть видалені, як тільки вони більше не будуть потрібні для цілей
        їх збору. Зазвичай, ця технічна інформація стирається або стає
        нерозпізнаваною не пізніше ніж через сім днів.
      </Text>
      <Text>
        Ми можемо збирати цю інформацію як частину log-файлів, а також за
        допомогою файлів cookie або інших технологій відстеження.
      </Text>
      <Text>
        Щоб дізнатися більше про використання нами файлів cookie та інших
        технологій відстеження, ознайомтеся з нашою 
        <SpanLink url="/uk/policies/cookies-policy">
          Політикою використання файлів cookie
        </SpanLink>
        .
      </Text>
      <Text>
        <Span>Якщо ви претендуєте на роботу в DOSIJEM</Span> і ви заповнюєте та
        надсилаєте форму заявки безпосередньо на нашому вебсайті або надсилаєте
        нам електронний лист зі своїм резюме, а також спілкуєтеся з нами під час
        співбесіди, ми збираємо наступну вашу особисту інформацію:
      </Text>
      <UlText>
        ідентифікаційні дані – такі як ваше ім’я, стать, фотографія, дата
        народження, ідентифікаційний номер працівника, мови;
      </UlText>
      <UlText>
        контактні дані – такі як домашня адреса, номер телефону, адреси
        електронної пошти та контактні дані для екстрених випадків;
      </UlText>
      <UlText>
        інформацію про зайнятість – таку як посада, місцезнаходження офісу, дати
        найму, трудові договори, результати роботи та дисциплінарні записи,
        процедури подання скарг, хвороби/відпустки;
      </UlText>
      <UlText>
        інформацію про освітню та професійну підготовку – таку як
        академічна/професійна кваліфікація, освіта, резюме, рекомендаційні листи
        та записи про співбесіди, дані про судимості (для цілей перевірки, де це
        допустимо та відповідає чинному законодавству).
      </UlText>
      <UlText>
        національний ідентифікатор – наприклад, національне посвідчення/паспорт,
        імміграційний статус і документи, візи, номери національного
        страхування;
      </UlText>
      <UlText>
        інформацію про сімейний стан – наприклад, інформацію про перебування у
        шлюбі, бенефіціарів та утриманців;
      </UlText>
      <UlText>
        іншу інформацію, якою ви вирішили поділитися з нами, наприклад хобі,
        соціальні уподобання тощо.
      </UlText>
      <Text>
        Найчастіше особисті дані, які ми збираємо від кандидатів, збираються
        безпосередньо від них. У деяких випадках Компанія може збирати особисті
        дані про кандидатів від третіх осіб, наприклад, коли ми виконуємо
        перевірку даних, які необхідні для роботи, яку має виконувати працівник.
        У більшості випадків DOSIJEM отримає ваш дозвіл, перш ніж збератиме ваші
        персональні дані від третьої сторони.
      </Text>
      <Text>
        Якщо ми попросимо вас надати будь-які інші персональні дані, не описані
        вище, тоді персональні дані, які ми будемо просити вас надати, і
        причини, чому ми просимо їх надати, будуть пояснені вам під час їх
        збору.
      </Text>
      <Text>
        DOSIJEM використовує та розкриває персональні дані, які ми збираємо,
        головним чином для цілей управління нашими трудовими відносинами з вами,
        а також для інших бізнес-цілей. Таке використання включає:
      </Text>
      <UlText>
        визначення придатності для найму, включаючи перевірку рекомендацій і
        кваліфікації та, якщо це дозволено законом, проведення перевірки даних;
      </UlText>
      <UlText>встановлення вимог до навчання та/або розвитку;</UlText>
      <UlText>
        дотримання законів і нормативних актів (наприклад, законів про працю та
        зайнятість, охорони здоров’я та безпеки, податкових,
        антидискримінаційних законів), згідно з судовим дозволом або для
        реалізації чи захисту законних прав;
      </UlText>
      <UlText>
        складання внутрішніх керівництв, наприклад керівництв для працівників;
      </UlText>
      <UlText>для виявлення шахрайства чи інших видів протиправних дій.</UlText>
      <Text>
        Ми також можемо використовувати ваші персональні дані для інших законних
        цілей, про які ми вам повідомимо, і за умови, що ми отримаємо вашу згоду
        на таке використання, якщо цього вимагає закон.
      </Text>
      <Text>
        Якщо ви подали заявку, але не стали нашим співробітником, ми залишаємо
        за собою право зберігати дані протягом трьох років, щоб надалі
        зв’язуватися з вами (надсилати інші вакансії та новини Компанії). В
        іншому випадку ми видалимо дані, щойно вони більше не будуть потрібними
        для досягнення мети їх збору.
      </Text>
      <Text>
        У будь-якому випадку ви маєте можливість у будь-який час відкликати свою
        згоду на обробку персональних даних, як це визначено тут.
      </Text>
      <Text>
        <Span>Якщо ви є співробітником DOSIJEM</Span>, ми збираємо особисту
        інформацію в межах, визначених для кандидата, а також додаткову особисту
        інформацію, таку як:
      </Text>
      <UlText>
        інформацію про стан здоров’я – наприклад, інформація про короткострокові
        або довготривалі періоди непрацездатності чи захворювання, якою ви
        можете поділитися зі співробітником або керівником HR департаменту  або
        зі своїм керівником, зокрема щодо будь-якої відпустки, якої ви можете
        потребувати;
      </UlText>
      <UlText>
        фінансову інформацію – таку як банківські реквізити, податкова
        інформація, інформація про заробітну плату, утримання, виплати, витрати,
        надбавки компанії;
      </UlText>
      <UlText>
        ІТ-інформацію – інформацію, необхідну для надання доступу до ІТ-систем і
        мереж Компанії, наприклад IP-адреси, log-файли, інформацію для входу,
        дані інвентаризації програмного/апаратного забезпечення.
      </UlText>
      <UlText>
        DOSIJEM використовує та розкриває особисті дані, які ми збираємо,
        головним чином для цілей управління нашими трудовими відносинами з вами,
        а також для інших бізнес-цілей. Таке використання включає:
      </UlText>
      <UlText>
        адміністрування заробітної плати та пільг, а також обробка претензій
        працівників, пов’язаних з роботою (наприклад, компенсація працівникам,
        страхові претензії тощо) і заявок на відпустку;
      </UlText>
      <UlText>встановлення вимог до навчання та/або розвитку;</UlText>
      <UlText>
        перевірка виконання роботи та визначення вимог до її виконання;
      </UlText>
      <UlText>дисциплінарні стягнення або звільнення;</UlText>
      <UlText>
        встановлення екстрених контактів та реагування на надзвичайні ситуації;
      </UlText>
      <UlText>
        дотримання законів і нормативних актів (наприклад, законів про працю та
        зайнятість, охорони здоров’я та безпеки, податків, антидискримінаційних
        законів), згідно з судовим дозволом або для реалізації чи захисту
        законних прав;
      </UlText>
      <UlText>
        складання внутрішніх керівництв, наприклад керівництв для працівників;
      </UlText>
      <UlText>для виявлення шахрайства чи інших видів протиправних дій;</UlText>
      <UlText>ІТ-безпека та адміністрування;</UlText>
      <UlText>
        для інших законних цілей, обґрунтовано необхідних для повсякденних
        операцій, таких як бухгалтерський облік, фінансова звітність і
        бізнес-планування.
      </UlText>
      <Text>
        Ми також можемо використовувати ваші персональні дані для інших законних
        цілей, про які ми вам повідомимо, і за умови, що ми отримаємо вашу згоду
        на таке використання, якщо цього вимагає закон.
      </Text>
      <Text>
        Компанія також може збирати певні демографічні дані, які кваліфікуються
        як чутливі персональні дані, такі як расова та етнічна належність,
        релігія, сексуальна орієнтація та інвалідність, щоб допомогти нам
        зрозуміти різноманіття нашої робочої сили. Ми збираємо такі чутливі
        персональні дані лише для внутрішнього використання (наприклад: для
        привітань з важливими для вас святами, визначення графіку додаткових
        вихідних або відпусток, покращення робочого простору згідно з вашими
        переконаннями або особливостями). Чутливі персональні дані не є і не
        будуть предметом передачі будь-яким третім особам, навіть тим, що
        визначені в розділах «ОБМІН ПЕРСОНАЛЬНИМИ ДАНИМИ» та «МІЖНАРОДНА
        ПЕРЕДАЧА ПЕРСОНАЛЬНИХ ДАНИХ» цієї Політики. Ця інформація збирається,
        зазвичай, на підставі добровільної згоди, і працівники не зобов’язані
        надавати цю інформацію, окрім випадків, коли нам необхідно збирати таку
        інформацію для виконання наших юридичних зобов’язань.
      </Text>
      <Text>
        Ми зберігатимемо ваші персональні дані стільки часу, скільки необхідно
        для досягнення цілей, описаних вище, або протягом іншого часу,
        передбаченого законодавством. Зазвичай це означає, що ми зберігатимемо
        ваші персональні дані до закінчення вашого працевлаштування у нас, а
        також, за потреби, протягом розумного періоду часу після цього для
        відповіді на будь-які запити щодо працевлаштування, вирішення юридичних,
        податкових, бухгалтерських чи адміністративних питань або виплати вам
        поточної пенсії чи інших пільг. У таких випадках передчасне видалення
        даних можливе, якщо тільки договірні, податкові та юридичні зобов’язання
        не забороняють видалення.
      </Text>
      <Text>
        <Span>Якщо ви є клієнтами або підрядниками DOSIJEM</Span>
      </Text>
      <Text>
        Перш за все майте на увазі, будь-яке посилання в цій Політиці на наших
        «клієнтів» або «підрядників» включає їхніх співробітників або інший
        персонал, чиї особисті дані ми збираємо.
      </Text>
      <Text>
        При співпраці з клієнтами або підрядниками ми збираємо таку особисту
        інформацію:
      </Text>
      <UlText>
        ідентифікаційні дані – такі як ваше ім’я, стать, дата народження, мови,
        посада;
      </UlText>
      <UlText>
        контактні дані – такі як місцезнаходження офісу, номер телефону, адреса
        електронної пошти;
      </UlText>
      <UlText>
        національний ідентифікатор – наприклад, національне посвідчення
        особи/паспорт, імміграційний статус і документи;
      </UlText>
      <UlText>
        фінансова інформація – така як банківські реквізити, податкова
        інформація;
      </UlText>
      <UlText>
        інша договірна інформація – будь-яка інформація, яка є або буде
        необхідною для укладення та виконання договору.
      </UlText>
      <UlText>
        DOSIJEM використовує та розкриває персональні дані, які ми збираємо,
        головним чином для цілей виконання договору: якщо нам потрібно виконати
        договір, який ми збираємося укласти або який ми уклали з вами як
        стороною, або для вжиття заходів на ваш запит перед укладенням такого
        договору разом з іншими комерційними цілями, такими як:
      </UlText>
      <UlText>
        дотримання законів і нормативних актів (наприклад, податкового,
        антикорупційного законодавства), згідно з судовим дозволом або для
        здійснення чи захисту законних прав;
      </UlText>
      <UlText>складання внутрішніх керівництв;</UlText>
      <UlText>для виявлення шахрайства чи інших видів протиправних дій;</UlText>
      <UlText>ІТ-безпека та адміністрування;</UlText>
      <UlText>
        для інших законних цілей, обґрунтовано необхідних для повсякденних
        операцій, таких як бухгалтерський облік, фінансова звітність і
        бізнес-планування.
      </UlText>
      <Text>
        DOSIJEM використовує та розкриває персональні дані, які ми збираємо,
        головним чином для цілей виконання договору: якщо нам потрібно виконати
        договір, який ми збираємося укласти або який ми уклали з вами як
        стороною, або для вжиття заходів на ваш запит перед укладенням такого
        договору разом з іншими комерційними цілями, такими як:
      </Text>
      <UlText>
        дотримання законів і нормативних актів (наприклад, податкового,
        антикорупційного законодавства), згідно з судовим дозволом або для
        здійснення чи захисту законних прав;
      </UlText>
      <UlText>складання внутрішніх керівництв;</UlText>
      <UlText>для виявлення шахрайства чи інших видів протиправних дій;</UlText>
      <UlText>ІТ-безпека та адміністрування;</UlText>
      <UlText>
        для інших законних цілей, обґрунтовано необхідних для повсякденних
        операцій, таких як бухгалтерський облік, фінансова звітність і
        бізнес-планування.
      </UlText>
      <Text>
        Ми також можемо використовувати ваші персональні дані для інших законних
        цілей, про які ми вам повідомимо, і за умови, що ми отримаємо вашу згоду
        на таке використання, якщо цього вимагає закон.
      </Text>
      <Text>
        Ми зберігатимемо ваші персональні дані стільки часу, скільки необхідно
        для досягнення цілей, описаних вище, або протягом іншого часу,
        передбаченого законодавством. Як правило, це означає, що ми
        зберігатимемо ваші персональні дані до завершення ваших ділових відносин
        з нами, а також розумний період часу після цього, якщо це необхідно для
        відповідей на будь-які ділові запити, вирішення юридичних, податкових,
        бухгалтерських або адміністративних питань. У таких випадках передчасне
        видалення даних можливе, якщо тільки договірні, податкові та юридичні
        зобов’язання не забороняють видалення.
      </Text>
      <SectionHeader>ПЕРСОНАЛЬНІ ДАНІ НЕПОВНОЛІТНІХ</SectionHeader>
      <Text>
        Наш вебсайт, а також наші послуги не орієнтовані на дітей віком до 16
        років. Ми свідомо не збираємо інформацію від дітей віком до 16 років.
        Якщо ви не досягли вікового обмеження, не використовуйте вебсайт і не
        надавайте нам свою особисту інформацію. 
        <Span>
          У разі виявлення персональних даних неповнолітніх, наданих через наш
          вебсайт, ми негайно видаляємо такі дані.
        </Span>
      </Text>
      <Text>
        Якщо ви є батьками дитини, яка не досягла граничного віку, і ви
        дізналися, що ваша дитина надала Компанії особисту інформацію, будь
        ласка, зв’яжіться з нами за адресою SupportDosijem@gmail.com і
        наполягайте на реалізації своїх прав на доступ, виправлення, скасування
        та/або заперечення.
      </Text>
      <Text>
        <Span>
          DOSIJEM звертається до батьків, усиновлювачів, опікунів та інших
          законних представників з проханням роз’яснити своїм дітям питання
          безпеки в Інтернеті, їх конкретну мету та необхідність використання
          вебсайту.
        </Span>
      </Text>
      <SectionHeader>ОБМІН ПЕРСОНАЛЬНИМИ ДАНИМИ</SectionHeader>
      <Text>
        Ми не продаємо та іншим чином не передаємо стороннім особам будь-яку
        особисту інформацію та не надаємо жодну особисту інформацію третім
        сторонам у бізнес-інтересах чи маркетингових цілях цих третіх сторін (за
        винятком випадків, коли ви прямо запитуєте або надаєте нам згоду робити
        так).
      </Text>
      <Text>
        <Span>
          Однак за деяких обставин нам потрібно поділитися вашими даними з
          третіми особами, як зазначено нижче.
        </Span>
      </Text>
      <Text>
        <Span>Обробка даних від нашого імені:</Span>
      </Text>
      <Text>
        Компанія залучає певних сторонніх постачальників і провайдерів послуг
        для виконання певних функцій обробки даних від нашого імені Це можуть
        бути, зокрема, центри обробки даних, які зберігають наш вебсайт і бази
        даних, постачальники ІТ-послуг, які обслуговують наші системи, і
        консалтингові компанії. Якщо ми передаємо дані обробникам, вони можуть
        використовувати дані лише для виконання своїх завдань. Процесори були
        ретельно відібрані нами. Вони договірно зобов’язані виконувати наші
        інструкції, мають відповідні технічні та організаційні заходи для
        захисту прав суб’єктів даних і регулярно контролюються нами.
      </Text>
      <Text>
        <Span>Надання послуг для нас або від нашого імені: </Span>
      </Text>
      <Text>
        Компанія може передати ваші дані довіреним третім сторонам, які
        допомагають нам керувати нашим вебсайтом, вести наш бізнес або
        обслуговувати вас. Ми передаємо дані, які ми зібрали, лише якщо це
        необхідно для виконання договору або для забезпечення технічної
        функціональності вебсайту, або якщо існує інша необхідність або правова
        підстава для передачі даних. Такі довірені сторони можуть мати доступ до
        особистої інформації на основі принципу «службової необхідності » та за
        контрактом будуть зобов’язані зберігати вашу інформацію конфіденційною.
      </Text>
      <Text>
        <Span>Дотримання юридичних зобов’язань:</Span>
      </Text>
      <Text>
        Компанія може розкривати вашу особисту інформацію третій стороні, якщо 
      </Text>
      <Text>
        (1) ми обґрунтовано вважаємо, що розкриття вимагається чинним
        законодавством, постановою, судовим процесом або урядовим запитом
        (зокрема для забезпечення національної безпеки, екстрених служб або
        вимоги правоохоронних органів),
      </Text>
      <Text>(2) для виконання наших угод і політик,</Text>
      <Text>
        (3) для захисту безпеки або цілісності наших послуг і продуктів,
      </Text>
      <Text>
        (4) щоб захистити себе, наших інших клієнтів або громадськість від шкоди
        чи незаконної діяльності, або
      </Text>
      <Text>
        (5) для реагування на надзвичайні ситуації, які, на нашу думку,
        добросовісно вимагають від нас розкриття даних, щоб допомогти запобігти
        смерті або серйозним тілесним ушкодженням.
      </Text>
      <Text>
        Якщо згідно із законом DOSIJEM зобов’язана розкрити будь-яку особисту
        інформацію про вас, ми повідомимо вас про вимогу розкриття, якщо це не
        заборонено законом. Крім того, ми заперечуємо проти запитів, які, на
        нашу думку, не були надані належним чином.
      </Text>
      <Text>
        <Span>Передача особистої інформації учасникам Групи DOSIJEM: </Span>
      </Text>
      <Text>
        Компанія може надавати вашу особисту інформацію членам Групи DOSIJEM.
        Такі Учасники використовуватимуть інформацію лише відповідно до цієї
        Політики.
      </Text>
      <Text>
        <Span>Передача бізнесу: </Span>
      </Text>
      <Text>
        Якщо Компанія проходить корпоративний продаж, злиття, реорганізацію,
        розпуск або подібну подію, дані, які ми збираємо від вас, можуть бути
        частиною активів, переданих або наданих у зв’язку з належною обачністю
        будь-якої такої операції. У такій ситуації, і лише в цій ситуації, ми
        можемо передати ваші дані у спосіб, який є продажем відповідно до
        чинного законодавства. Якщо ми це зробимо, ми повідомимо вас заздалегідь
        і вимагатимемо від будь-якого покупця або правонаступника DOSIJEM
        продовжувати обробку даних відповідно до цієї Політики конфіденційності.
      </Text>
      <Text>
        <Span>Передача зведених або деідентифікованих даних: </Span>
      </Text>
      <Text>
        Ми також можемо надавати дані про наших відвідувачів третім сторонам,
        якщо дані були деідентифіковані або зведені таким чином, щоб їх
        неможливо було використати для вашої ідентифікації. Ми робимо це для
        реалізації наших маркетингових, рекламних чи інших цілей.
      </Text>
      <SectionHeader>ОБМІН ПЕРСОНАЛЬНИМИ ДАНИМИ</SectionHeader>
      <Text>
        DOSIJEM використовує послуги, постачальники яких частково розташовані в
        так званих третіх країнах (за межами Європейського Союзу чи Європейської
        економічної зони) або обробляють персональні дані там, тобто в країнах,
        рівень захисту даних яких не відповідає рівню Європейського Союзу. Якщо
        це так і Європейська комісія не видала рішення щодо відповідності (ст.
        45 GDPR) для цих країн, ми вжили відповідних заходів, щоб забезпечити
        належний рівень захисту даних для будь-якої передачі даних. До них
        належать, серед іншого, стандартні договірні положення Європейського
        Союзу або обов’язкові внутрішні правила захисту даних.
      </Text>
      <Text>
        Крім того, в таких випадках ми надамо лише мінімальний обсяг
        персональних даних, необхідний для цілей обробки, і, де це можливо, ми
        надамо персональні дані в анонімній формі.
      </Text>
      <SectionHeader>БЕЗПЕКА ТА ЦІЛІСНІСТЬ ПЕРСОНАЛЬНИХ ДАНИХ</SectionHeader>
      <Text>
        Захист інформації, яку ви нам надаєте або яку ми отримуємо про вас, є
        нашим пріоритетом. Компанія вживає відповідних заходів безпеки, щоб
        захистити вашу інформацію від втрати, неправильного використання та
        несанкціонованого доступу, зміни, розголошення чи знищення. Компанія
        DOSIJEM вжила заходів для забезпечення постійної конфіденційності,
        цілісності, доступності та стійкості систем і служб, які обробляють
        особисту інформацію, і своєчасно відновить доступність і доступ до
        інформації у разі фізичного чи технічного інциденту.
      </Text>
      <Text>
        Зверніть увагу, що жоден сервіс не є повністю безпечним. Незважаючи на
        те, що ми прагнемо захистити ваші дані, ми не можемо гарантувати, що
        несанкціонований доступ, взлом, втрата чи порушення даних ніколи не
        відбудеться.
      </Text>
      <SectionHeader>ВАШІ ПРАВА ВІДПОВІДНО ДО GDPR</SectionHeader>
      <Text>
        Вам надаються наступні права відповідно до положень GDPR (Загального
        регламенту захисту даних):
      </Text>
      <UlText>право на інформацію (стаття 15 GDPR);</UlText>
      <UlText>право на виправлення (стаття 16 GDPR);</UlText>
      <UlText>
        право на видалення («право бути забутим») (стаття 17 GDPR);
      </UlText>
      <UlText>право на обмеження обробки (стаття 18 GDPR);</UlText>
      <UlText>
        право на повідомлення – зобов’язання щодо повідомлення щодо виправлення
        чи видалення персональних даних або обмеження обробки (стаття 19 GDPR);
      </UlText>
      <UlText>право на перенесення даних (стаття 20 GDPR);</UlText>
      <UlText>право на заперечення (стаття 21 GDPR);</UlText>
      <UlText>
        право не бути суб’єктом рішення, заснованого виключно на автоматизованій
        обробці – включаючи профілювання – (стаття 22 GDPR);- право відкликати
        згоду (стаття 7(3) GDPR).
      </UlText>
      <Text>
        Ви можете отримати доступ до своїх персональних даних, видалити,
        обмежити їх використання, перенести або відкликати згоду на їх
        використання), зв’язавшись з нами електронною поштою
        dosijemhelp@gmail.com
      </Text>
      <Text>
        Ми зберігаємо ваші персональні дані лише до тих пір, поки це необхідно
        для наших відносин з вами, відповідно до нашої політики зберігання та
        чинного законодавства. Ми не обробляємо більше персональних даних, ніж
        нам потрібно для досягнення наших цілей, викладених у цій Політиці
        конфіденційності, і ми не будемо зберігати їх довше, ніж це необхідно.
      </Text>
      <Text>
        Якщо пізніше ви накажете нам видалити ваші персональні дані, ми це
        зробимо (зверніть увагу, що для повного видалення даних з усіх систем
        може знадобитися до тридцяти днів).
      </Text>
      <Text>
        Винятком є випадки, коли передчасне видалення даних можливе, якщо тільки
        договірні, податкові та юридичні зобов’язання не забороняють видалення.
      </Text>
      <Text>
        Якщо ви вважаєте, що обробка ваших даних порушує GDPR або що ваші права
        на захист даних були порушені будь-яким іншим чином, ви можете подати
        скаргу до відповідного регуляторного органу.
      </Text>
      <SectionHeader>ДОТРИМАННЯ КОНФІДЕНЦІЙНОСТІ В DOSIJEM</SectionHeader>
      <Text>
        DOSIJEM дотримується принципів, встановлених 
        <SpanLink
          newTab
          url="https://eur-lex.europa.eu/legal-content/EN/ALL/?uri=celex%3A32016R0679&%3Btid=%5Badsimpletextid%5d"
        >
          Загальний регламент захисту даних (ЄС) 2016/679
        </SpanLink>
        .
      </Text>
      <Text>
        Ми як «контролери даних» цим гарантуємо, що ваша особиста інформація:
      </Text>
      <UlText>обробляється законно, чесно та прозоро;</UlText>
      <UlText>
        збирається для певних, явних і законних цілей і не обробляється надалі у
        спосіб, який є несумісним із цими цілями («обмеження цілей»);
      </UlText>
      <UlText>
        є адекватним, відповідним і обмеженим тим, що необхідно для цілей, для
        яких воно обробляється («мінімізація даних»);
      </UlText>
      <UlText>
        є точним і, якщо необхідно, оновлюється. Вжито всіх розумних заходів для
        того, щоб особисті дані, які були неточними, з огляду на цілі, для яких
        вони оброблялися, були стерті або виправлені без затримки («точність»);
      </UlText>
      <UlText>
        зберігається у формі, яка дозволяє ідентифікувати вас не довше, ніж це
        необхідно для цілей, для яких обробляються персональні дані («обмеження
        зберігання»);
      </UlText>
      <UlText>
        обробляється у спосіб, який забезпечує належний захист персональних
        даних, включаючи захист від несанкціонованої або незаконної обробки, а
        також від випадкової втрати, знищення або пошкодження з використанням
        відповідних технічних та/або організаційних заходів («цілісність і
        конфіденційність»).
      </UlText>
      <SectionHeader>ДОТРИМАННЯ КОНФІДЕНЦІЙНОСТІ В DOSIJEM</SectionHeader>
      <Text>
        DOSIJEM залишає за собою право час від часу оновлювати цю Політику
        конфіденційності, публікуючи переглянуту Політику на вебсайті та
        вказуючи в Політиці конфіденційності дату останнього оновлення.
      </Text>
      <Text>
        Ми рекомендуємо вам переглядати цю Політику кожного разу, коли ви
        відвідуєте наш вебсайт, щоб визначити, чи були внесені будь-які зміни, і
        переконатися, що ви розумієте, як будуть оброблятися будь-які надані
        вами персональні дані.
      </Text>
      <Text>
        <Span>Ця Політика була востаннє змінена 18 жовтня 2023 року.</Span>
      </Text>
    </Stack>
  );
}
